multiSpeciesMassTransportLibrary/testCase/reactingFoam_mixing/0/N2
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";


    class volScalarField;
    object N2;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField

{
    inletAir
    {
        type            fixedValue;
        value           uniform 0.7653;
    }
    inletFuel
    {
        type            fixedValue;
        //value           uniform 0.7253;
        value           uniform 0.9477; 
    }
    
       outlet          
    {
        type            zeroGradient;
    }

    wallBetween
    {
        type            zeroGradient;
    }

    side
    {
        type            symmetryPlane;
    }

    down
    {
        type            symmetryPlane;
    }
    
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
