multiSpeciesMassTransportLibrary/testCase/reactingFoam_mixing/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inletAir
    {
        type            fixedValue;
        value           uniform 0.2347;
    }

    inletFuel
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet          
    {
        type            zeroGradient;
    }

    wallBetween
    {
        type            zeroGradient;
    }

    side
    {
        type            symmetryPlane;
    }

    down
    {
        type            symmetryPlane;
    }
    
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
