multiSpeciesMassTransportLibrary/testCase/reactingFoam_mixing/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices        
(
    ( 0      0       0 ) //0
    ( 2      0       0 ) //1
    ( 30     0       0 ) //2
    ( 30     2       0 ) //3
    ( 30     3       0 ) //4
    ( 30     5       0 ) //5
    ( 2      5       0 ) //6
    ( 0      5       0 ) //7
    ( 0      3       0 ) //8
    ( 2      3       0 ) //9
    ( 2      2       0 ) //10
    ( 0      2       0 ) //11

    ( 0      0     0.1 ) //12
    ( 2      0     0.1 ) //13
    ( 30     0     0.1 ) //14
    ( 30     2     0.1 ) //15
    ( 30     3     0.1 ) //16
    ( 30     5     0.1 ) //17
    ( 2      5     0.1 ) //18
    ( 0      5     0.1 ) //19
    ( 0      3     0.1 ) //20
    ( 2      3     0.1 ) //21
    ( 2      2     0.1 ) //22
    ( 0      2     0.1 ) //23

);

blocks          
(
    hex (0 1 10 11 12 13 22 23)    ( 7   20   1)   simpleGrading (0.6   1   1) //0
    hex (1 2 3 10 13 14 15 22)     (80   20   1)   simpleGrading (3     1   1) //1
    hex (10 3 4 9 22 15 16 21)     (80   10   1)   simpleGrading (3     1   1) //2
    hex (9 4 5 6 21 16 17 18)      (80   10   1)   simpleGrading (3     3   1) //3   
    hex (8 9 6 7 20 21 18 19)      ( 7   10   1)   simpleGrading (0.6   3   1) //4
);

edges           
(
);


boundary
(
    inletAir
    {
        type patch;
        faces
        (
            (8 20 19 7)
        );
    }

    inletFuel
    {
        type patch;
        faces
        (
            (0 12 23 11)
        );
    }

    outlet 
    {
	type patch;
        faces
        (
            (3 15 14 2)
            (4 16 15 3)
            (5 17 16 4)
        );
    }

    side 
    {
        type symmetryPlane;
	//type symmetry;
        faces 
        (
            (7 19 18 6)
            (6 18 17 5)
        );
    }

    wallBetween
    {
        type wall;
        faces
        (
            (8 9 21 20)
            (10 22 21 9)
            (11 10 22 23)
        );
    }

    down
    {
        type symmetryPlane;
        faces
        (
            (0 1 13 12)
            (1 2 14 13)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0  1 10 11)
            (1 2 3 10)
            (10 3 4 9)
            (9 4 5 6)
            (8 9 6 7)        
            (12 13 22 23)
            (13 14 15 22)
            (22 15 16 21)
            (21 16 17 18)
            (20 21 18 19)
        );
    }
);

//patches         
//(
//    patch inletAir 
//    (
//        (8 20 19 7)
//    )
//    
//    patch inletFuel 
//    (
//        (0 12 23 11)
//    )
//    patch outlet 
//    (
//        (3 15 14 2)
//        (4 16 15 3)
//        (5 17 16 4)
//    )
//    symmetryPlane side 
//    (
//        (7 19 18 6)
//        (6 18 17 5)
//    )
//    wall wallBetween 
//    (
//        (8 9 21 20)
//        (10 22 21 9)
//        (11 10 22 23)
//    )
//    symmetryPlane down 
//    (
//        (0 1 13 12)
//        (1 2 14 13)
//    )
//    empty frontAndBackPlanes
//    (
//        (0  1 10 11)
//        (1 2 3 10)
//        (10 3 4 9)
//        (9 4 5 6)
//        (8 9 6 7)
//        
//        (12 13 22 23)
//        (13 14 15 22)
//        (22 15 16 21)
//        (21 16 17 18)
//        (20 21 18 19)
//    )
//);

mergePatchPairs
(
);

// ************************************************************************* //

